package Tsykala.lesson04;

/*
Вывести таблицу умножения 10 x 10 (двоныйм циклом),
но вывод должен быть словами:

Ожидаемый вывод:
два умножить на два равно четыре
два умножить на три равно шесть
два умножить на четыре равно восемь
два умножить на пять равно десять
два умножить на шесть равно двенадцать
два умножить на семь равно четырнадцать
два умножить на восемь равно шестнадцать
два умножить на девять равно восемнадцать
два умножить на десять равно двадцать
три умножить на два равно шесть
три умножить на три равно девять
три умножить на четыре равно двенадцать
...
и т.д. до фразы
...
десять умножить на десять равно сто
*/

import java.util.Scanner;

public class TaskC3 {
 /* static String digit(int n) {
        String[] e =("один","",""..."десять", "одинадцать",... "девятнадцать")
        String[] d = ("-", "двадцать",... "девяносто", "сто")
        If (n<20)
                return e[n];
//        int d = n/10;
//        int i= n % 10
               else if (n % 10 ==0)
                    return t[n/10 - 1]
                    else
                        return t[n / 10-1]+""+e[n%10 - 1];
               psvm
       public class TaskB2 {
           public static void main(String[] args) {
               Scanner sc=new Scanner(System.in);
               int size = sc.nextInt();
               for (int i = 2; i <= size; i++) {
                   for (int j = 2; j <=size ; j++) {
                       System.out.print(digit(i) + "умнож на" + digit(j) + равно + +digit(i*j)
                   System.out.println("");
               }
           }

       }
                       System.out.println(digit(23))

//        public static void main(String[] args) {
//            Scanner sc=new Scanner(System.in);
//            int size = sc.nextInt();
//            Int x1
//            for (int i = 2; i <= 10; i++) {
//                for (int j = 2; j <=10 ; j++) {
//                    System.out.println(i * j + " ");
//                }
//                System.out.println("");
//            }
//        }
//
*/
}
